---
kind: type
id: T:Autodesk.Revit.DB.ExportLinetypeTableIterator
source: html/901e037c-f870-f85f-8002-3223ff6c2061.htm
---
# Autodesk.Revit.DB.ExportLinetypeTableIterator

An iterator to a set of line type table.

## Syntax (C#)
```csharp
public class ExportLinetypeTableIterator : IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>>
```